{
  "about": {
    "title": "About Me",
    "description": "Hey! 👋\nI'm a Team Lead at DocuWare, and a Software Engineer at heart.\n\nI believe in the power of teamwork and live by the motto: \n<i>\"If I made someone's life better, then it was worth it.\"</i>\n\nWhether it's a small feature or a complex project, I aim to ensure that everything we create makes a positive difference for both my colleagues and our customers.\n\nI'm learning the ways of leading a team. Leadership is something I always enjoyed, as it allows me to impact the team's success and support my colleagues in achieving their professional and personal goals.\n\nOn the Software Engineering side, I have the most fun in frontend development, particularly with <b>React</b>, but I have always worked with full stack development, mostly with <b>C#</b> (and <b>.NET</b>), <b>Microsoft SQL</b>, <b>JavaScript</b>, <b>HTML</b>, and <b>CSS</b>.\nOver the years, I've also gained experience with <b>CI/CD</b>, automated pipelines, <b>Infrastructure as Code</b>, <b>Terraform</b> and <b>Microsoft Azure</b>."
  },
  "skills": {
    "title": "Skills",
    "frontend": "Frontend Development",
    "backend": "Backend Development",
    "tools": "Tools & Technologies"
  },
  "experience": {
    "title": "Experience",
    "years": "{{years}} years",
    "companies": [
      {
        "company": "DocuWare",
        "roles": [
          {
            "title": "Team Lead",
            "period": "Apr 2024 – Present",
            "description": "Team Lead of the Client Solutions Team. Manage daily activities of a key team developing self-service business portals for partners and direct customers. Responsibilities include leading and mentoring the team, managing onboarding, ensuring alignment with company goals, solving problems, promoting collaboration, managing workloads, ensuring policy compliance, reporting to management, and setting a positive example."
          },
          {
            "title": "Software Engineer",
            "period": "Nov 2020 – Apr 2024",
            "description": "Software Engineer in the Client Solutions team. Maintained and developed solutions supporting the company's ecosystem. Focused on frontend development with a wide-ranging tech stack: Backend (ASP.NET Core, C#, F#, SQL), Frontend (TypeScript, JavaScript, SCSS, HTML), Frameworks (React, StencilJS, Vaadin), Microservices, CI/CD, Terraform, Azure DevOps, and more."
          }
        ]
      },
      {
        "company": "MECOMO AG",
        "roles": [
          {
            "title": "Software Engineer",
            "period": "Nov 2019 – Nov 2020",
            "description": "Relocated to Germany after completing my bachelor's degree. Worked on various projects, creating new features, maintaining code, and providing support for different departments. Utilized technologies such as ASP.NET MVC, C#, SQL, HTML, CSS, JavaScript, jQuery, Bootstrap, Microsoft TFS, Google Maps, and more."
          },
          {
            "title": "Software Engineer",
            "period": "Dec 2018 – Nov 2019",
            "description": "Returned to Brazil to complete my bachelor's degree, continued working on projects for MECOMO AG remotely."
          },
          {
            "title": "Software Engineer",
            "period": "Jan 2018 – Dec 2018",
            "description": "Moved to Germany for a year to gain international experience, working on a variety of projects and technologies."
          },
          {
            "title": "Junior Software Engineer",
            "period": "May 2016 – Jan 2018",
            "description": "Joined MECOMO do Brasil, the Brazilian subsidiary of MECOMO AG. Worked as a full stack developer on web applications for telemetry information and reporting. Tech stack: ASP.NET MVC, C#, SQL, HTML, CSS, JavaScript, Web Forms, Windows Forms, jQuery, Bootstrap, Microsoft TFS, Google Maps, Bing Maps, OpenStreetMap, AG Grid. Briefly explored Node.js for a specific project."
          }
        ]
      },
      {
        "company": "DBServer",
        "roles": [
          {
            "title": "Test Automation Engineer",
            "period": "Aug 2015 – May 2016",
            "description": "Promoted to this role and worked on projects for Dell Inc., developing automated tests. Tech stack: ASP.NET and C#, Selenium WebDriver, Postman, SoapUI."
          },
          {
            "title": "Intern",
            "period": "Mar 2015 – Aug 2015",
            "description": "Contributed to an agile project for GV Energy (now ENGIE), working on both backend and frontend development. Tech stack: ASP.NET MVC, Microsoft SQL Server, LINQ, HTML, CSS, JavaScript, Bootstrap, jQuery, FontAwesome, AmCharts, FullCalendar, Google Maps, OpenStreetMap."
          }
        ]
      }
    ]
  },
  "document": {
    "title": "My Portfolio"
  },
  "role": {
    "title": "Software Engineer & Team Lead"
  },
  "settings": {
    "language": "Language",
    "theme": "Theme",
    "light": "Light",
    "dark": "Dark"
  },
  "navigation": {
    "about": "About me",
    "experience": "Experience"
  }
} 